Revit 2027 API
ScheduleDefinition.ShowTitle Property
 Indicates if the title will be displayed in the schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowTitle { get; set; }
Public Property ShowTitle As Boolean
	Get
	Set
public:
property bool ShowTitle {
	bool get ();
	void set (bool value);
}
member ShowTitle : bool with get, set
Property Value
Boolean
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace